# Casks (Pre-compiled applications)
cask "nrfutil"
cask "nrf-connect"
cask "nordic-nrf-command-line-tools"
cask "segger-jlink"
cask "android-platform-tools"

# Core utilities
brew "wget"
brew "coreutils"

# Modern CLI tools
brew "git"
brew "neovim"
brew "tmux"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "ack"
brew "starship"
brew "chezmoi"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "poppler"


# Embedded & C/C++ Development (Zephyr/NCS Essentials)
brew "cmake"
brew "ninja"
brew "gperf"
brew "dtc"
brew "qemu"
brew "ccache"
brew "libmagic"
brew "python"
brew "python-tk"
brew "west"
brew "arm-none-eabi-gcc"
brew "openocd"
brew "picocom"

# Runtimes for LSP (Mason)
brew "node"
brew "go"
brew "uv"
brew "cmake-language-server"
brew "protobuf"
brew "protobuf-c"

# Optional basic Cask (Terminal)
# cask "iterm2" # Can uncomment if iterm2 itself needs to be managed by brew
